## 피봇 데이블

데이터 열 중에서 두개를 키로 사용하여 데이터를 선택하는 방법을 뜻한다.<br/>
피봇 테이블을 사용하기 위해서는 키가 되는 두개의 열 혹은 필드를 선택하여 이 두열을 행과 열 인덱스로 변경하고 조건에 맞는 데이터를 넣는다

In [1]:
import pandas as pd
import numpy as np

In [2]:
data ={
    'state' : ['Ohio','Ohio','Ohio','Nevada','Nevada'],
    'year' : [2000,2001,2002,2001,2002],
    'pop' : [1.5, 2.5, 3.0, 2.5, 3.5]
}
df = pd.DataFrame(data, columns = ["state","year","pop"])
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  2.5
2    Ohio  2002  3.0
3  Nevada  2001  2.5
4  Nevada  2002  3.5

pivot 메서드는, 첫번쨰 인수로는 행 인덱스로 사용할 열의 이름, 두번째 인수로는 열 인덱스로 사용할 열 이름, 그리고 마지막엔 데이터로 사용할 열 이름을 넣는다.
- pivot
- set_index

In [3]:
df.pivot("state","year","pop")

year    2000  2001  2002
state
Nevada   NaN   2.5   3.5
Ohio     1.5   2.5   3.0

In [4]:
df.set_index(["state","year"]).unstack()

        pop
year   2000 2001 2002
state
Nevada  NaN  2.5  3.5
Ohio    1.5  2.5  3.0

## 그룹분석
특정 조건에 맞는 데이터가 하나 이상 즉, 그룹인 경우에는 그룹분석을 해야한다. 
- groupby : 데이터를 그룹별로 묶는 역할을 한다.
    - 열 또는 열의 리스트
    - 행 인덱스

- 연산의 결과로 groupby 클래서 객체를 반환하는데 이 객체는 그룹 연산 메서드가 내장되어있다

### 그룹 연산 매서드

groupby 클래스 객체 뒤에 있는 매서드는
- size(), count() : 갯수
- mean(), median(), min(), max() : 평균, 중앙, 최소, 최대
- sum(), prod(), std(), var(), quantile() : 합계, 곱, 표준편차, 분산, 사분위수
- first(), last() : 가장 처음 데이터와 나중데이터
- agee(), aggregate() : 함수를 만들어 전달한다.
- transform() : 대표값을 만든다음, 대표값을 새로운 열로 데이터 프레임에 추가한다.
- describe() : 하나의 대표값이 아니라 여러값을 데이터프레임으로 구한다.
- apply() : describe() 처럼 하나의 대표값이 아닌 데이터 프레임을 출력하지만 원하는 그룹 연산이 없는 경우에 사용한다.

데이터가 다음과 같을때 key1 값에 따른 data1의 평균을 구하시오

In [5]:
np.random.seed(0)
df = pd.DataFrame({
    'key1' : ['a','a','b','b','a'],
    'key2' : ['one','two','one','two','one'],
    'data1' : np.random.rand(5),
    'data2' : np.random.randn(5)
}
)
df

      data1     data2 key1 key2
0  0.548814 -0.842724    a  one
1  0.715189  1.969924    a  two
2  0.602763  1.266119    b  one
3  0.544883 -0.505877    b  two
4  0.423655  2.545201    a  one

In [6]:
df.pivot('key1','data1','data1')

data1  0.423655  0.544883  0.548814  0.602763  0.715189
key1
a      0.423655       NaN  0.548814       NaN  0.715189
b           NaN  0.544883       NaN  0.602763       NaN

In [7]:
df.groupby(df.key1).mean()

         data1     data2
key1
a     0.562553  1.224134
b     0.573823  0.380121

In [8]:
df.data1.groupby(df.key1).mean()

key1
a    0.562553
b    0.573823
Name: data1, dtype: float64

In [9]:
df.data1.groupby([df.key1, df.key2]).mean()

key1  key2
a     one     0.486234
      two     0.715189
b     one     0.602763
      two     0.544883
Name: data1, dtype: float64

In [10]:
df.data1.groupby([df.key1, df.key2]).mean().unstack("key2")

key2       one       two
key1
a     0.486234  0.715189
b     0.602763  0.544883

## pivot_table 명령

Pandas 는 pivot 명령과 groupby 명령의 중간성격인 pivot_table 명령도 제공한다. <br/>
<br/>
pivot_table 명령은 groupby명령처럼 그룹분석을 하지만 최종적으로는 pivot 명령처럼 테이블을 만든다. 즉 groupby 명령의 결과에 unstack을 자동으로 적용하여 2차원적인 형태로 변형한다.

- pivot_table(data, values=None, index=None, columns =None, aggfunc ='mean', fill_value=None, margines=False, margins_name='All')
- data : 분석할 데이터 프레임
- value : 분석할 데이터 프레임에서 선택한 열
- index : 행 인덱스로 들어갈 키열 또는 키 열의 리스트
- columns : 열 인덱스로 들어갈 키 열 또는 키 열의 리스트
- aggfunc : 분석 메서드
- fill_value : NaN 대체 값
- margins : 오른쪽과 아래에 합계를 붙일지 여부
- margins_name : 합계 열의 이름

In [11]:
df.pivot_table("data1","key1","key2")

key2       one       two
key1
a     0.486234  0.715189
b     0.602763  0.544883

In [12]:
df.pivot_table("data1","key1","key2",margins=True, margins_name ="합계")

key2       one       two        합계
key1
a     0.486234  0.715189  0.562553
b     0.602763  0.544883  0.573823
합계    0.525077  0.630036  0.567061